app/controllers/users_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Renato"], ["email", "renatolhernandez@hotmail.com"], ["created_at", "2024-01-05 14:00:43.337108"], ["updated_at", "2024-01-05 14:00:43.337108"], ["password", "120711"]]
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password", "$2a$12$RhtO5ZOgEEDkyR3lYrU0pOkWHSwDecliv9sB3NqpMdespqHtkgob6"], ["updated_at", "2023-07-26 21:04:14.169209"], ["id", 2]]
---
  def update
    user = params[:user]

    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    user = User.find(params[:user_id])